#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=9d8510bc-7f2c-49ab-83a2-099dd23eaf99]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1bed6e2e-ba8e-435c-994a-dd229a49f9d1]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1228035e-160a-4059-be47-ad2fdd3f6d2a]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b603cd1d-36d0-4ee3-b92b-12d65a308112]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f52e2b77-0da6-4e3f-a2ff-6f559c4e6c7c]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4bce0ae4-8c9e-43b9-b6a2-81ab80d51283]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e3e15e97-426b-4cd8-83fe-32cdfc8e37d9]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b31286d0-02b1-4817-8050-77945247f967]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4588592c-5cc4-4973-9655-d22d89a4003f]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=22f63304-b712-4d6d-bbdc-69923ea03f83]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=827fa47e-a277-4ca1-8f70-32efebfde745]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=abcbe85e-df8c-47ce-a7ab-d2a6a8dfe75e]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1f8477a8-9469-4178-8961-02ed2da74010]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3ad1d3b0-ee8d-4246-ba21-cd01d2786281]
module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5b25cd19-e93f-4287-a708-021c27588723]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=899ff4df-5513-47d9-9984-159efbad59ad]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e0e41cb5-7782-4314-81ee-445364b0753c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=59b7ccff-ffa1-45fd-a2c4-a0db7d1cc454]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f32acbb7-bf93-4b76-a104-99d74df97f59]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a564a503-cd0e-4ecb-ad80-6345c90fefc6]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a1d26907-f28d-4c71-ae7c-18474511b1e9]
module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=13337dba-71d0-4644-bee8-2fb81e27237f]
module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=40b351b0-95dc-4655-ba63-56591f01f65d]
module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3bff73ee-cbf8-4142-b7d9-678e8bdc7af9]
module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=85101d4a-d58c-4266-814e-914fa55c3ceb]
module.keycloak_dev.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=06631a43-490f-4d97-81d8-3ff9f26fab09]
module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=ea7a15fd-9b89-44ff-a41b-4417b6ed8fa3]
module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fe175114-f39a-4a62-a7ee-2fe3f30443dd]
module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=022a7b3d-fac7-4562-9b3b-346078dc7cdd]
module.keycloak_dev.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=08346474-8310-498f-8fb2-24607b2b9751]
module.keycloak_dev.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=304cb256-e1c7-4c11-850b-b80ab78070b7]
module.keycloak_dev.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=fddf8063-f7c5-4f86-b8c1-1a29aa9be1fd]
module.keycloak_dev.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=44585eb0-97d0-41cf-a77c-a0cfc360eb70]
module.keycloak_dev.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=61b74404-7cf9-466e-a204-dd8ff09b5f4d]
module.keycloak_dev.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5a53756c-89ac-49d4-aba0-5faa65301b77]
module.keycloak_dev.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=3d26559c-33d0-4bb3-b80c-8b0fb2b66f89]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c3f970ba-ca17-41d6-9d1b-82d93b2c0f73]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7915bc73-ef3a-466e-b682-ed5cd19a6daa]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ee6a86a2-5463-4c19-8c67-534ceeca5b54]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9cd98501-8ecc-496c-891f-57bfcf588b33]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=99c79e30-cb9b-42fa-bfd9-caf161c67729]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dfd4fc73-bdca-4d80-a2cf-830c64578465]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7d3b53b5-2eb8-46e8-8bd4-07379eebea72]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d41103f5-8c51-4a83-ae6e-8cf373d77148]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=15ff4ea0-70ea-441f-b423-8bd2e53c7fef]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=50d10ec2-4cf1-4af7-8c92-91cc5b91259b]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a46b9e29-bcfb-45f6-b769-3cf9086a2b81]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6bc93bd1-34a3-45bb-ba59-0f80457c55d4]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5ba3baf8-c971-484a-bf4a-e652e1fea0f4]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3b91fdc2-3e61-4481-b6c9-55f044b76a39]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f0c402eb-97b1-4384-9ca3-5330ca3059d1]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bbc1d716-2a45-459d-86cd-d16b42d6604e]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-4-5647.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4d31bce9-5155-4794-a24c-0e5f9dd7eb5b]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-4-5647.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ad9203d2-d9e2-4690-8f06-5d12e6307c36]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-4-5647.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=26237a85-3d0e-464c-9b3c-2b5c38cafb9d]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-4-5647.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=dbb414f1-b822-46f2-b86b-23aa38918c7c]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-4-5647.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2805786f-ec62-4a67-8f74-e8c55658bd20]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-4-5647.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0bc3a68a-f776-4196-8b86-9c2ff1cedde1]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-4-5647.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f5cd2750-00b6-4536-a819-a4ced7955f09]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-4-5647.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d13bcc72-3244-4b65-b1e8-560c82df93c4]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-b-ce-id-add-prod-later-6172.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=24bec4f0-6471-4465-9351-d4af20a52ab5]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-b-ce-id-add-prod-later-6172.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=7380adc8-519e-47f4-996f-f113f86c7151]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-b-ce-id-add-prod-later-6172.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3d41c7b1-17d9-48ce-81c5-4f21d2eac1a1]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=07ba0da1-dc37-450a-afb5-daef9551eb7e]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=96b9351e-8a31-49e0-b9c0-517639e7d236]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a6ae35d9-5d61-4705-ad38-c5136866a1a3]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2871b1e0-719a-41b0-bc7c-a4db1923c469]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-b-ce-id-add-prod-later-6172.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f53362f8-dd29-4e5f-83f0-6e406d2eddb9]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=83d95a20-8363-4f99-8619-7b3991dba8d8]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ded15d3f-dee9-47bd-b03b-f88dbd574868]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-b-ce-id-add-prod-later-6172.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=cf786be6-ed19-49a7-b787-6462c09dc237]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=55bb3928-b97f-4aae-9011-faf5a92d5d7e]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-b-ce-id-add-prod-later-6172.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=173652bb-16a2-477d-8c74-912357952c98]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-b-ce-id-add-prod-later-6172.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e09ae252-c8e7-454e-bd18-7ebbaf9978c1]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6f1e226a-a94f-4481-86a5-3459a7628694]
module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=56fcc3e0-be75-47be-b2aa-8abf33b3e67d]
module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=260fd095-6dd3-4ffa-b7e2-08f35c4c012d]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-b-ce-id-add-prod-later-6172.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=444af853-4761-476c-8416-fa7f93212837]
module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d7b59495-fd8e-46af-ba38-ccbfe9c729d2]
module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=63e1a681-ee52-4328-91b1-04570180e239]
module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f49e1d76-b89b-4617-924f-d01b112ca1ba]
module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d89973b9-1d81-4195-8900-bf4f11b9091a]
module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=71187e43-256b-44f4-84e9-0bf6706f6ce6]
module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b40f5701-890b-43ac-8549-1f5860557b48]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8b159a9c-9fd3-4b91-99c8-a9c0137e4c8b]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=235ae496-9ddc-4276-b295-d20ddaf975c7]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=9ee4aef4-74f4-40b2-8d50-ae2408f52f2b]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-5-5648.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=13fc997d-5320-44d8-9cb1-63e5668d8a20]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d8778526-a35a-471b-a951-bb1e04fabbf1]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c410a701-d3c9-424a-b6a8-2c1bf9c5f64e]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-5-5648.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ad361a8f-14bd-4e8a-a5b7-0d96373f2ceb]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2ee40dce-26eb-4e2f-9e6c-f62a93b551d0]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-5-5648.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=18d62552-3b67-4074-9942-2846d9560d50]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=80e8d9cb-ee2e-4d47-8afd-a33691744f9b]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-5-5648.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0e71a808-2146-48b7-bb90-8606da9202c2]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4d8793e2-7000-4f0b-85c9-ee9c4be687cb]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=09d5f50c-87c4-4ef6-816d-7fd60d1ee4c1]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=76c2b784-3a1f-402f-8443-979ad265f81a]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4602c64b-fdf5-439d-8dfd-94b2a2d87c5e]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-5-5648.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3bfaafeb-a358-44d9-83af-7551da268956]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=20145990-6a3b-48d5-8c99-99733194dee5]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-5-5648.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0cd90951-3974-4276-893e-d4775fa74853]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3378987d-b723-4617-beec-77a81337de78]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-5-5648.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=32491dd1-2866-43d3-ae66-05001331f575]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c4361a63-3caa-4f6c-ace3-919d449fa6ff]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c86dff16-eaa8-40b7-a90d-4eca47a68f48]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-5-5648.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5081c32e-19da-4c0b-a350-eb43d956af4c]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=866dfed7-4420-44da-9583-ab73ec94f1e6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-03-b-ce-id-both-test-6239.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "kuro-mar-03-b-ce-id-both-test-6239"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-03-b-ce-id-both-test-6239.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-03-b-ce-id-both-test-6239.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-03-b-ce-id-both-test-6239.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-03-b-ce-id-both-test-6239.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "kuro-mar-03-b-ce-id-both-test-6239"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-03-b-ce-id-both-test-6239.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-03-b-ce-id-both-test-6239.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-03-b-ce-id-both-test-6239.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-03-b-ce-id-both-test-6239.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "kuro-mar-03-b-ce-id-both-test-6239"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "kuro-mar-03-b-ce-id-both-test-6239"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-both"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://bceidDev.com",
        ]
      + web_origins                              = [
          + "+",
          + "http://bceidDev.com",
        ]
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-03-b-ce-id-both-test-6239.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "kuro-mar-03-b-ce-id-both-test-6239"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-03-b-ce-id-both-test-6239.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-03-b-ce-id-both-test-6239.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-03-b-ce-id-both-test-6239.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-03-b-ce-id-both-test-6239.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "kuro-mar-03-b-ce-id-both-test-6239"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-03-b-ce-id-both-test-6239.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-03-b-ce-id-both-test-6239.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-03-b-ce-id-both-test-6239.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-03-b-ce-id-both-test-6239.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "kuro-mar-03-b-ce-id-both-test-6239"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "kuro-mar-03-b-ce-id-both-test-6239"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-both"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://bceidTest.com",
        ]
      + web_origins                              = [
          + "+",
          + "https://bceidTest.com",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3735 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*